export const ru = {
  nav: {
    home: "Главная",
    services: "Услуги",
    resume: "Резюме",
    portfolio: "Портфолио",
    programs: "Программы",
    social: "Социальная жизнь",
    articles: "Статьи",
    contact: "Контакты",
  },
  common: {
    learnMore: "Узнать больше",
    back: "Назад",
    keyFeatures: "Ключевые особенности",
  },
  home: {
    greeting: "Привет, я",
    role: "Инженер-программист",
    description: "Создание технологических решений",
    downloadCV: "Скачать резюме",
    lastUpdates: "Последние обновления",
    stats: {
      experience: "Лет опыта",
      projects: "Реализованных проектов",
      technologies: "Используемые технологии",
      awards: "Полученные награды",
    },
    titles: {
      first: "Под управлением ИИ",
      roles: [
        "Компьютерный ученый",
        "Инженер-программист",
        "Инженер-электронщик",
      ],
    },
    updates: [
      {
        id: 1,
        text: "Запуск нового портфолио сайта",
        date: "Март 2024",
      },
    ],
  },
  about: {
    title: "Обо мне",
    description:
      "Я интересовался обучением с юных лет. Мой интерес к инженерии исходит с детства. Я был тем, кто управлял школьным компьютером с помощью кодов Scratch, которые я разрабатывал на уроках информатики и реализовывал даже в очень молодом возрасте. Сейчас я предпринимаю необходимые шаги, чтобы стать успешным инженером. Благодаря усердной работе и опыту, полученному в моем учебном заведении, я уверен, что это будет достигнуто. Я стараюсь получить множество сертификатов и пройти обучение для этого.",
    info: [
      {
        fieldName: "Имя",
        fieldValue: "Берк Кая",
      },
      {
        fieldName: "Телефон",
        fieldValue: "Предоставляется при необходимости",
      },
      {
        fieldName: "Опыт",
        fieldValue: "2+ года",
      },
      {
        fieldName: "Steam",
        fieldValue: "loadonline",
      },
      {
        fieldName: "Национальность",
        fieldValue: "Турецкая",
      },
      {
        fieldName: "Email",
        fieldValue: "berkkaya0304@hotmail.com",
      },
      {
        fieldName: "Фриланс",
        fieldValue: "Доступен",
      },
      {
        fieldName: "Языки",
        fieldValue: "Турецкий, Английский, Немецкий",
      },
    ],
  },
  work: {
    title: "Мои проекты",
    description: "Мои последние работы и проекты",
    viewProject: "Просмотреть проект",
    filterAll: "Все",
    categories: {
      frontend: "Frontend",
      backend: "Backend",
      mobile: "Мобильные",
      desktop: "Десктопные",
      fullstack: "Full Stack",
      other: "Другое",
    },
    works: {
      aiPortfolio: {
        title: "Портфолио на базе ИИ",
        description:
          "Персональный сайт-портфолио, разработанный с использованием Next.js и React, с учетом современных принципов дизайна.",
      },
      tributePage: {
        title: "Страница Трибута",
        description:
          "Проект страницы трибута, разработанный с использованием базовых веб-технологий.",
      },
      technicalDocs: {
        title: "Техническая документация",
        description: "Проект страницы технической документации.",
      },
      surveyPage: {
        title: "Страница Опросника",
        description: "Проект страницы с формой опроса.",
      },
      onePagePortfolio: {
        title: "Одностраничное портфолио",
        description: "Проект одностраничного сайта-портфолио.",
      },
      firewall: {
        title: "Firewall",
        description:
          "Лесные пожары могут происходить естественным путем, но часто они вызваны человеком. В последние годы число лесных пожаров увеличивается с каждым днем. В некоторых странах лесные пожары выходят из-под контроля. Именно поэтому мы создали приложение для борьбы с ними: Firewall.",
      },
    },
  },
  services: {
    title: "Мои услуги",
    description:
      "Специализированные решения в разработке программного обеспечения, облачных вычислениях и цифровой трансформации",
    fullstack: {
      title: "Full-Stack Разработка",
      description:
        "Full-Stack Разработка охватывает весь процесс разработки веб-приложений, от дизайна пользовательского интерфейса до серверной логики. Используя современные технологии и лучшие практики, мы создаем масштабируемые, эффективные и поддерживаемые приложения, которые соответствуют потребностям вашего бизнеса. Наш подход сочетает в себе превосходный фронтенд с надежными бэкенд-решениями для обеспечения бесшовного пользовательского опыта.",
      features: [
        "Современные фронтенд-фреймворки (React, Next.js)",
        "Надежная бэкенд-разработка",
        "Проектирование и оптимизация баз данных",
        "Разработка и интеграция API",
        "Адаптивный и mobile-first дизайн",
      ],
    },
    cloud: {
      title: "Облачные технологии",
      description:
        "Наши облачные решения помогают бизнесу использовать возможности облачных вычислений для повышения масштабируемости, безопасности и эффективности. Мы предоставляем комплексные облачные услуги, включая настройку инфраструктуры, миграцию, оптимизацию и управление на основных облачных платформах.",
      features: [
        "Настройка облачной инфраструктуры",
        "Сервисы AWS/Azure/GCP",
        "Реализация облачной безопасности",
        "Оптимизация масштабируемости",
        "Управление затратами",
      ],
    },
    data: {
      title: "Технологии данных",
      description:
        "Преобразуйте ваши сырые данные в практические идеи с помощью наших комплексных решений по обработке данных. Мы специализируемся на анализе, обработке и визуализации данных, чтобы помочь вам принимать обоснованные решения и стимулировать рост бизнеса с помощью стратегий, основанных на данных.",
      features: [
        "Анализ и визуализация данных",
        "Обработка больших данных",
        "Интеграция машинного обучения",
        "Аналитика в реальном времени",
        "Разработка конвейеров данных",
      ],
    },
    digitalization: {
      title: "Цифровизация",
      description:
        "Осуществите цифровую трансформацию с нашими комплексными услугами по цифровизации. Мы помогаем организациям модернизировать их процессы, внедрять цифровые решения и создавать эффективные рабочие процессы, которые повышают продуктивность и инновации в цифровую эпоху.",
      features: [
        "Стратегия цифровой трансформации",
        "Автоматизация процессов",
        "Модернизация устаревших систем",
        "Оптимизация цифровых рабочих процессов",
        "Интеграционные решения",
      ],
    },
  },
  resume: {
    title: "Резюме",
    experience: "Опыт работы",
    experienceDescription:
      "В этом разделе вы можете найти информацию о моих стажировках, частичной и полной занятости.",
    experienceList: [
      {
        company: "Huawei",
        position: "Стажер-инженер облачных технологий длительной стажировки",
        duration: "Сентябрь 2024 - Январь 2025",
        time: "(5 месяцев)",
      },
      {
        company: "Basarsoft",
        position: "Стажер-инженер-программист",
        duration: "Август 2024 - Сентябрь 2024",
        time: "(2 месяца)",
      },
      {
        company: "Huawei",
        position: "Стажер-инженер облачных технологий",
        duration: "Июль 2024 - Август 2024",
        time: "(2 месяца)",
      },
      {
        company: "Nurol Technology",
        position: "Участник проекта",
        duration: "Январь 2024 - Июнь 2024",
        time: "(6 месяцев)",
      },
      {
        company: "QNB Finansbank",
        position: "Стажер Finance 101",
        duration: "Январь 2024 - Февраль 2024",
        time: "(2 месяца)",
      },
      {
        company: "Huawei",
        position: "Стажер FullStack разработчик",
        duration: "Август 2023 - Сентябрь 2023",
        time: "(2 месяца)",
      },
      {
        company: "Турецкая товарная биржа",
        position: "Стажер FullStack разработчик",
        duration: "Июль 2023 - Август 2023",
        time: "(2 месяца)",
      },
    ],
    education: "Образование",
    educationDescription:
      "В этом разделе вы увидите информацию о моем образовании в целом.",
    educationList: [
      {
        institution: "Университет TED",
        degree: "Инженерия компьютерных систем",
        duration: "Сентябрь 2022 - Июль 2026",
      },
      {
        institution: "Google Academy",
        degree: "Игры и приложения",
        duration: "Декабрь 2022 - Август 2023",
      },
      {
        institution: "Молодежная академия руководителей",
        degree: "Стать руководителем",
        duration: "Январь 2023 - Июнь 2023",
      },
      {
        institution: "Университет TED",
        degree: "Подготовка по английскому языку",
        duration: "Сентябрь 2021 - Июль 2022",
      },
    ],
    voluntarily: "Волонтерский опыт",
    voluntarilyDescription:
      "В этом разделе вы можете найти информацию о моей волонтерской деятельности.",
    voluntarilyList: [
      {
        company: "Модельные суды правосудия",
        position: "Директор по ИТ и дизайну",
        duration: "Сентябрь 2024 - Сентябрь 2025",
        time: "(1 год)",
      },
      {
        company: "Программа развития лидеров",
        position: "Лидер команды веб-сайта",
        duration: "Октябрь 2023 - Октябрь 2024",
        time: "(1 год)",
      },
      {
        company: "Проект Tübitak",
        position: "Участник",
        duration: "Октябрь 2023 - Август 2024",
        time: "(11 месяцев)",
      },
      {
        company: "TEDU Наука и Технологии",
        position: "Президент",
        duration: "Июль 2022 - Август 2023",
        time: "(1 год 1 месяц)",
      },
    ],
    skills: "Технические навыки",
    skillsDescription:
      "Здесь представлены мои технические навыки и уровень владения ими.",
    softSkills: "Гибкие навыки",
    softSkillsDescription:
      "Здесь представлены мои межличностные и профессиональные гибкие навыки.",
    viewResults: "Нажмите здесь для всех результатов (турецкий)",
    rating: "Оценка",
    references: "Рекомендации",
    referencesDescription:
      "Профессиональные рекомендации и отзывы от коллег и руководителей.",
    referencesList: [
      {
        name: "Илкер Джанбулут",
        position: "Создатель программы развития лидеров",
        image: "/assets/resume/references/ilkercanbulut.jpg",
        testimonial:
          "Берк Кая – ответственный человек, превосходящий в лидерстве и командной работе, способный создавать инновационные решения благодаря многопрофильному подходу. С его способностью видеть общую картину, фокусироваться на деталях и внушать доверие, он готов стать ценным лидером будущего.",
      },
    ],
    softSkillsList: [
      {
        name: "Самоуправление",
        rating: 100,
        description: "Устойчивость",
      },
      {
        name: "Самокомпетентность",
        rating: 90,
        description: "Устойчивость",
      },
      {
        name: "Справляться со стрессом",
        rating: 95,
        description: "Устойчивость",
      },
      {
        name: "Управление эмоциями",
        rating: 98,
        description: "Устойчивость",
      },
      {
        name: "Управление отношениями",
        rating: 100,
        description: "Устойчивость",
      },
      {
        name: "Фокус на цели, планирование",
        rating: 99,
        description: "Устойчивость",
      },
      {
        name: "Построение близких отношений",
        rating: 87,
        description: "Личность",
      },
      {
        name: "Уровень стресса",
        rating: 39,
        description: "Личность",
      },
      {
        name: "Ориентация на мышление",
        rating: 96,
        description: "Личность",
      },
    ],
    ambassadorPrograms: [
      {
        company: "IBM",
        topic: "Капитан Z",
        duration: "Сентябрь 2024 - настоящее время",
        description:
          "Я один из 6 капитанов-амбассадоров, которые будут руководить более 150 амбассадорами в этом году.",
        level: "(Уровень 4 - Высший уровень)",
      },
      {
        company: "IBM",
        topic: "Студенческий амбассадор Z",
        duration: "Ноябрь 2023 - настоящее время",
        description:
          "Программа IBM Z Student Ambassador – это глобальное сообщество студентов университетов, страстно увлеченных технологиями. Благодаря практическому обучению, наставничеству и возможностям сетевого взаимодействия, амбассадоры получают навыки и опыт, необходимые для успешной работы в сфере технологий.",
        level: "(Уровень 4 - Высший уровень)",
      },
      {
        company: "Xbox",
        topic: "Амбассадор",
        duration: "Сентябрь 2023 - настоящее время",
        description:
          "Программа Xbox Ambassador – это сообщество геймеров, которые стремятся сделать игры веселыми для всех.",
        level: "Уровень 2",
      },
      {
        company: "Microsoft",
        topic: "Студенческий амбассадор",
        duration: "Ноябрь 2023 - Сентябрь 2024",
        description:
          "Будучи Microsoft Learn Student Ambassador, вы получите практический опыт работы с технологиями Microsoft, такими как Azure, Windows и Office 365, развивая при этом необходимые навыки для индустрии технологий, включая решение проблем, коммуникацию и командную работу. Вы также получите возможность связаться с разнообразной сетью студентов, сотрудников Microsoft и лидеров отрасли. Делясь своими знаниями, вы внесете значимый вклад, помогая другим учиться и расти.",
        level: "(Alpha)",
      },
    ],
    certifications: "Сертификаты",
    ambassador: "Опыт участия в программах амбассадора",
    ambassadorDescription:
      "В этом разделе вы можете найти информацию о моих программах амбассадора.",
    filterAll: "Все сертификаты",
    references: "Рекомендации",
    viewCertificate: "Просмотреть сертификат",
    selectCategory: "Выбрать категорию",
  },
  program: {
    title: "Все программы",
    description: "Все программы, в которых я участвовал ранее",
    viewOnLinkedIn: "Просмотреть в LinkedIn",
    programs: [
      {
        title: "Кодирование с IBM: CyberStart",
        company: "IBM",
        description: "Изучение нового в области кибербезопасности",
        skills: ["Кибербезопасность"],
      },
      {
        title: "Программа развития лидеров",
        company: "Программа развития лидеров",
        description: "Изучение нового в области лидерства",
        skills: ["Лидерство", "Управление", "Личный бренд"],
      },
      {
        title: "Huawei Coding Marathon'24",
        company: "Huawei",
        description: "Создание проекта в области кодирования по ЦУР 12",
        skills: ["Кодирование", "Управление проектами"],
      },
      {
        title: "Оборонная промышленность 401",
        company: "Секретариат оборонной промышленности",
        description:
          "Получение информации об оборонной промышленности в Турции",
        skills: ["Оборонная промышленность"],
      },
      {
        title: "Aselsan Work Life 101",
        company: "Aselsan",
        description: "Изучение нового о рабочей жизни",
        skills: ["Рабочая жизнь", "Оборонная промышленность"],
      },
      {
        title: "Seeds for the Future Italy'24",
        company: "Huawei",
        description: "Tech 4 Good Competition Europe Grand Final",
        skills: ["Социальное предпринимательство"],
      },
      {
        title: "Программа «Сделай шаг вперед»",
        company: "McKinsey & Company",
        description:
          "Программа «Сделай шаг вперед» - это шестимесячная полностью финансируемая виртуальная программа, разработанная для приобретения навыков и опыта, необходимых для успешной карьеры в бизнесе.",
        skills: ["Бизнес"],
      },
      {
        title: "Стипендия AWS AI&ML",
        company: "Amazon Web Services",
        description:
          "Этот курс поможет мне в будущем, особенно подготовиться к возникающим тенденциям в области искусственного интеллекта и распознать новые возможности, которые появятся перед искусственным интеллектом.",
        skills: ["Искусственный интеллект", "Машинное обучение"],
      },
      {
        title: "Виртуальная программа опыта работы инженером-программистом",
        company: "Electronic Arts",
        description:
          "У меня была возможность глубоко изучить множество аспектов инженерии программного обеспечения и получить опыт работы над реальными проблемами в ходе этой интенсивной программы.",
        skills: ["Инженерия программного обеспечения"],
      },
    ],
  },
  social: {
    title: "Социальная деятельность",
    description:
      "Ознакомьтесь с моими культурными и развлекательными мероприятиями",
    books: {
      title: "Список книг",
      description: "Мое путешествие в чтении и книги, которые я прочитал",
      totalBooks: "Всего книг",
      totalPages: "Всего страниц",
    },
    movies: {
      title: "Список фильмов",
      description: "Мое путешествие в просмотре и фильмы, которые я посмотрел",
      totalMovies: "Всего фильмов",
      totalDuration: "Общая продолжительность",
    },
    theaters: {
      title: "Список театров",
      description: "Театральные представления и спектакли, которые я посетил",
      totalShows: "Всего представлений",
      averageRating: "Средний рейтинг",
    },
    categories: {
      all: "Все",
      movies: "Фильмы",
      books: "Книги",
      music: "Музыка",
      games: "Игры",
      sports: "Спорт",
    },
    items: [
      {
        title: "Киноночь",
        category: "movies",
        description: "Просмотр последних фильмов и их обсуждение",
        date: "Еженедельно",
      },
      {
        title: "Книжный клуб",
        category: "books",
        description: "Чтение и обсуждение различных книг",
        date: "Ежемесячно",
      },
      {
        title: "Музыкальные сессии",
        category: "music",
        description: "Игра на гитаре и пение с друзьями",
        date: "Еженедельно",
      },
      {
        title: "Игровые турниры",
        category: "games",
        description: "Участие в онлайн-игровых турнирах",
        date: "Ежемесячно",
      },
      {
        title: "Баскетбольные игры",
        category: "sports",
        description: "Игра в баскетбол с друзьями",
        date: "Еженедельно",
      },
    ],
    viewMore: "Посмотреть больше",
    filterBy: "Фильтр по категории",
    noItems: "В этой категории нет элементов",
    table: {
      title: "Название",
      author: "Автор",
      pages: "Страницы",
      rating: "Рейтинг",
      date: "Дата",
      director: "Режиссер",
      duration: "Продолжительность",
      genre: "Жанр",
      theater: "Театр",
      play: "Пьеса",
      venue: "Место",
      year: "Год",
      completed: "Завершено",
      watched: "Просмотрено",
    },
  },
  blog: {
    title: "Статьи",
    description:
      "Сборник моих статей и писем на различные темы в области технологий и разработки программного обеспечения.",
    filters: {
      all: "Все статьи",
      english: "Английский",
      turkish: "Турецкий",
    },
    table: {
      title: "Название",
      author: "Автор",
      publication: "Публикация",
      date: "Дата",
      category: "Категория",
      link: "Ссылка",
    },
  },
  contact: {
    title: "Контакты",
    getInTouch: "Связаться",
    description:
      "Не стесняйтесь обращаться для сотрудничества по проектам или просто для дружеской беседы",
    contactMe: "Связаться со мной",
    form: {
      firstName: "Имя",
      lastName: "Фамилия",
      email: "Email",
      phone: "Телефон",
      selectService: "Выбрать услугу",
      message: "Введите ваше сообщение",
      submit: "Отправить",
      successMessage: "Электронное письмо успешно отправлено!",
      errorMessage:
        "Достигнут дневной лимит. Пожалуйста, попробуйте снова завтра.",
    },
    info: {
      title: "Контактная информация",
      phoneAvailable: "Предоставляется по запросу",
      address: "Йенимахалле, Анкара, Турция",
      followMe: "Следите за мной",
    },
  },
  dates: {
    months: {
      march: "Март",
      april: "Апрель",
      june: "Июнь",
      july: "Июль",
      august: "Август",
      september: "Сентябрь",
      october: "Октябрь",
      november: "Ноябрь",
      december: "Декабрь",
    },
  },
};
